# set - множество

"""
Создание множества:
set1 = {}
set1 = set()

"""

"""
функции множеств
.add(n) - добавление элемента в множество одного
.update([1,2,3]) - добавление последовательности элементов в множество
.remove(2) - удаляет если есть, возвращает ошибку, если нет
.discard(2) - удаляет если есть, ничего не делает, если нет
.pop() - удаляет случайный элемент
len(name_set) - длина множества
.copy() - создаёт копию
.clear() - очищает множество
del name_set - удаляет множество
name_set_1 | name_set_2 или name_set_1.union(name_set_2) - объединяет множества 
name_set_1 & name_set_2 или name_set_1.intersection(name_set_2) - Показывает общие объекты множеств
name_set_1 - name_set_2 или name_set_1.difference(name_set_2) - показывает элементы множества name_set_1, которых нет во втором
name_set_1 ^ name_set_2 или name_set_1.symmetric_difference(name_set_2) - показывает уникальные элементы обоих множеств
name_set_2 <= name_set_1 или name_set_1.issubset(name_set_2) - проверка, все ли элементы второго списка есть в первом

"""



